; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-7-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-3 - location
	p1-2 - location
	p1-7 - location
	p2-6 - location
	p2-8 - location
	p2-9 - location
	p3-1 - location
	p3-9 - location
	p4-0 - location
	p6-4 - location
	p7-2 - location
	p7-6 - location
	p7-9 - location
	p8-3 - location
	p9-5 - location
	p9-6 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s4)
	(at driver5 s5)
	(at driver6 s3)
	(at driver7 s3)
	(at driver8 s7)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s6)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s7)
	(empty truck6)
	(at truck7 s9)
	(empty truck7)
	(at package1 s2)
	(at package2 s8)
	(at package3 s6)
	(at package4 s1)
	(at package5 s1)
	(at package6 s7)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s5)
	(link s5 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s8)
	(link s8 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s8)
	(link s8 s6)
	(link s7 s4)
	(link s4 s7)
	(link s9 s1)
	(link s1 s9)
	(link s9 s2)
	(link s2 s9)
	(link s9 s3)
	(link s3 s9)
	(link s9 s5)
	(link s5 s9)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s9)
	(at driver6 s0)
	(at driver7 s2)
	(at driver8 s8)
	(at truck2 s1)
	(at truck5 s9)
	(at truck6 s3)
	(at truck7 s9)
	(at package1 s3)
	(at package2 s7)
	(at package3 s4)
	(at package4 s9)
	(at package5 s6)
	(at package6 s3)
	))


)

; plan
1. (board-truck driver4 s4 truck1)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 15
2. (drive-truck driver4 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 1 of 15
3. (load-truck s6 package3 truck1)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   goals met: 1 of 15
4. (board-truck driver8 s7 truck2)
   deleted: (at driver8 s7) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 1 of 15
5. (board-truck driver1 s5 truck5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 1 of 15
6. (load-truck s7 package6 truck2)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   goals met: 1 of 15
7. (drive-truck driver8 s7 s3 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   goals met: 1 of 15
8. (drive-truck driver8 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 2 of 15
9. (load-truck s1 package5 truck2)
   deleted: (at package5 s1)
   added: (in package5 truck2)
   goals met: 2 of 15
10. (load-truck s1 package4 truck2)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 2 of 15
11. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 2 of 15
12. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 2 of 15
13. (walk driver2 s3 p3-9)
   deleted: (at driver2 s3)
   added: (at driver2 p3-9)
   goals met: 2 of 15
14. (walk driver2 p3-9 s9)
   deleted: (at driver2 p3-9)
   added: (at driver2 s9)
   goals met: 3 of 15
15. (drive-truck driver1 s5 s9 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s9)
   goals met: 4 of 15
16. (drive-truck driver1 s9 s2 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s2)
   goals met: 3 of 15
17. (drive-truck driver4 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 3 of 15
18. (unload-truck s4 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 4 of 15
19. (drive-truck driver4 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 4 of 15
20. (disembark-truck driver4 s7 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s7) (empty truck1)
   goals met: 4 of 15
21. (board-truck driver4 s7 truck6)
   deleted: (at driver4 s7) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 4 of 15
22. (drive-truck driver4 s7 s3 truck6)
   deleted: (at truck6 s7)
   added: (at truck6 s3)
   goals met: 5 of 15
23. (load-truck s2 package1 truck5)
   deleted: (at package1 s2)
   added: (in package1 truck5)
   goals met: 5 of 15
24. (walk driver6 s3 p0-3)
   deleted: (at driver6 s3)
   added: (at driver6 p0-3)
   goals met: 5 of 15
25. (walk driver6 p0-3 s0)
   deleted: (at driver6 p0-3)
   added: (at driver6 s0)
   goals met: 6 of 15
26. (walk driver7 s3 p8-3)
   deleted: (at driver7 s3)
   added: (at driver7 p8-3)
   goals met: 6 of 15
27. (walk driver7 p8-3 s8)
   deleted: (at driver7 p8-3)
   added: (at driver7 s8)
   goals met: 6 of 15
28. (walk driver7 s8 p2-8)
   deleted: (at driver7 s8)
   added: (at driver7 p2-8)
   goals met: 6 of 15
29. (walk driver7 p2-8 s2)
   deleted: (at driver7 p2-8)
   added: (at driver7 s2)
   goals met: 7 of 15
30. (drive-truck driver1 s2 s8 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s8)
   goals met: 7 of 15
31. (load-truck s8 package2 truck5)
   deleted: (at package2 s8)
   added: (in package2 truck5)
   goals met: 7 of 15
32. (drive-truck driver1 s8 s0 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   goals met: 7 of 15
33. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 7 of 15
34. (unload-truck s3 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s3)
   goals met: 8 of 15
35. (drive-truck driver1 s3 s7 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s7)
   goals met: 8 of 15
36. (unload-truck s7 package2 truck5)
   deleted: (in package2 truck5)
   added: (at package2 s7)
   goals met: 9 of 15
37. (drive-truck driver1 s7 s5 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s5)
   goals met: 9 of 15
38. (drive-truck driver1 s5 s9 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s9)
   goals met: 10 of 15
39. (drive-truck driver8 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 9 of 15
40. (unload-truck s3 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s3)
   goals met: 10 of 15
41. (disembark-truck driver1 s9 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s9) (empty truck5)
   goals met: 10 of 15
42. (walk driver1 s9 p9-6)
   deleted: (at driver1 s9)
   added: (at driver1 p9-6)
   goals met: 10 of 15
43. (walk driver1 p9-6 s6)
   deleted: (at driver1 p9-6)
   added: (at driver1 s6)
   goals met: 11 of 15
44. (disembark-truck driver8 s3 truck2)
   deleted: (driving driver8 truck2)
   added: (at driver8 s3) (empty truck2)
   goals met: 11 of 15
45. (board-truck driver3 s3 truck2)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 15
46. (drive-truck driver3 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 12 of 15
47. (walk driver8 s3 p8-3)
   deleted: (at driver8 s3)
   added: (at driver8 p8-3)
   goals met: 12 of 15
48. (walk driver8 p8-3 s8)
   deleted: (at driver8 p8-3)
   added: (at driver8 s8)
   goals met: 13 of 15
49. (drive-truck driver3 s1 s6 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   goals met: 12 of 15
50. (unload-truck s6 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s6)
   goals met: 13 of 15
51. (drive-truck driver3 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 14 of 15
52. (drive-truck driver3 s1 s9 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s9)
   goals met: 13 of 15
53. (unload-truck s9 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s9)
   goals met: 14 of 15
54. (drive-truck driver3 s9 s1 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   goals met: 15 of 15
